src/main/java/no/vipps/demo/controller/NewFile.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sal="http://banqsoft.com/schemas/services/v2/SalesFinance/" xmlns:com="http://banqsoft.com/schemas/services/v2/Common/">
   <soapenv:Header>
      <sal:RequestHeader>
         <com:Authentication>
            <com:UserName>informix</com:UserName>
            <com:UserPassword>informix</com:UserPassword>
         </com:Authentication>
      </sal:RequestHeader>
   </soapenv:Header>
   <soapenv:Body>
      <sal:CreateFinanceRequest>         
         <sal:Basis>                                    
<!--             <sal:AccountReference> 
                  <sal:AccountName>${_loanAccountName}</sal:AccountName>
               </sal:AccountReference> -->
               <sal:FinanceType>Loan</sal:FinanceType>                       
         </sal:Basis>    
          <sal:BuyerReference>
               <sal:CustomerNumber>${_loanCustomerNumber}</sal:CustomerNumber>               
            </sal:BuyerReference>                       
         <sal:FinanceReference>         
            <sal:ExternalReference>${_financeRef}</sal:ExternalReference>
         </sal:FinanceReference>
         <sal:Items>            
            <sal:CreateFinanceItem>
               <sal:Orderline>                  
                  <sal:Amount>10</sal:Amount>                  
                  <sal:Article>Nice TV</sal:Article>                  
                  <sal:Description>Nice TV desc</sal:Description>                  
                  <sal:Quantity>3</sal:Quantity>                                    
               </sal:Orderline>
            </sal:CreateFinanceItem>            
         </sal:Items>         
         <sal:MerchantReference>            
            <sal:CustomerNumber>${_merchantNumber}</sal:CustomerNumber>            
         </sal:MerchantReference>
      </sal:CreateFinanceRequest>
   </soapenv:Body>
</soapenv:Envelope>